{
	"name": "Kirolos Mahfouz",
	"email": "kirolosmahfouz15@gmail.com",
	"description": "Frontend Developer 💻 Typescript | JavaScript | React | Css | Sass",
	"summary": [
		"As a Frontend Developer with experience in building high-quality web applications, I am passionate about creating responsive and user-friendly interfaces that provide exceptional user experiences. My technical skills include React, Redux, TypeScript, and Next.js, as well as a variety of front-end frameworks and libraries. I am also proficient in HTML, CSS, and JavaScript, and I have experience with testing and debugging tools.",

		"I have experience working on various projects, including a cloud-based dental patient education and practice management software, where I was responsible for building the front-end and connecting it to the back-end using APIs. I am also proud of my work on my official portfolio, a single-page application with a modern design and interactive animations. Additionally, I have experience working on landing pages and e-commerce websites, where I have optimized performance and created beautiful animations."
	],
	"experience": [
		"Frontend Developer at BeClarified (Remote) | Jul 2022 - Present",
		"Build the frontend of the cloud-based dental patient education and practice management software for BeClarified using React, TypeScript, Redux Toolkit and Tailwindcss.",
		"Translate designs and wireframes into high-quality code, ensuring a seamless user experience.",
		"Connect the frontend with the backend using APIs to enable smooth data flow and functionality.",
		"Contribute to the development and improvement of the user experience, through implementing new features and enhancing existing ones.",
		"Received a recommendation from my direct manager for my quality of work and contributions to the project."
	],
	"skills": [
		"React",
		"TypeScript",
		"Next.js",
		"Redux",
		"React Testing Library",
		"Unit Testing ( Jest )",
		"Sass",
		"Styled Components",
		"Bootstrap",
		"Tailwindcss",
		"Material UI",
		"Pug",
		"Gulp",
		"Git / Github",
		"Command Line ( CLI )",
		"NPM",
		"Html",
		"Css",
		"Javascript",
		"Restful API",
		"Jquery"
	],
	"languages": ["English", "Arabic"],
	"social_links": [
		{
			"id": 1,
			"website": "Github",
			"link": "https://github.com/Kmg11",
			"icon": "faGithubSquare"
		},
		{
			"id": 2,
			"website": "Linkedin",
			"link": "https://www.linkedin.com/in/kirolos-mahfouz/",
			"icon": "faLinkedin"
		},
		{
			"id": 3,
			"website": "Email",
			"link": "kirolosmahfouz15@gmail.com",
			"icon": "faEnvelopeSquare"
		}
	]
}
